code_alongs/08-api/quoteworld/app/controllers/api/quotes_controller.rb

  def index
    # @quotes = Quote.all
    # render json: @quotes
    @quotes = Quote.where("content ilike '%cake%'")
---
SELECT "quotes".* FROM "quotes" WHERE (content ilike '%cake%')

  def first3
    @quotes = Quote.all
    render json: @quotes.limit(3)
---
SELECT "quotes".* FROM "quotes"
SELECT  "quotes".* FROM "quotes" LIMIT $1  [["LIMIT", 3]]